Autodesk.Revit.ApplicationServices.ControlledApplication.OpenDocumentFile(Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.OpenOptions)
Opens a document from disk.
Remarks:
This method opens the document into memory but does not make it visible to the user in any way.
modelPath:
The file to be opened.
openOptions:
Options for opening the file.
Returns:
The opened document.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The modelPath to be opened is empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CannotOpenBothCentralAndLocalException:
Cannot open the local model and the central model in the same Revit session. You can close one to open the other in the same Revit session.
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelContentionException:
The model on the RevitServer is being accessed by other users.
-or-
The central model is locked by another client.
Throws Autodesk.Revit.Exceptions.CentralModelException:
Revit encountered serious errors while trying to open the central model.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.CorruptModelException:
There are too many corrupt elements to open this model.
Throws Autodesk.Revit.Exceptions.FileAccessException:
File cannot be opened in Revit LT because it was last saved in a version of Revit prior to 8.1.
-or-
File has an invalid extension. Try changing the file's extension and opening it again.
Throws Autodesk.Revit.Exceptions.FileNotFoundException:
The modelPath to be opened doesn't exist.
-or-
File Not Found
Throws Autodesk.Revit.Exceptions.InsufficientResourcesException:
This computer does not have enough memory, disk space, or other necessary resource to open the model.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Open is temporarily disabled.
-or-
The document can not be opened.
-or-
Revit cannot save the transmitted model as a new central because it is already opened.
Throws Autodesk.Revit.Exceptions.OperationCanceledException:
Opening was canceled by the user or by an API event callback.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.WrongUserException:
The local file is not owned by the current user, who therefore is not allowed to modify it.
Since:
2013

Autodesk.Revit.ApplicationServices.ControlledApplication.CopyModel(Autodesk.Revit.DB.ModelPath,System.String,System.Boolean)
Copies an existing model to a new file. Overwriting a file of the same name is allowed.
sourceModelPath:
The path of the file-based or server-based source model.
destFilePath:
The path of the destination file.
overwrite:
True if the destination file can be overwritten; otherwise, false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.CentralModelAccessDeniedException:
Access to the central model was denied. A possible reason is because the model was under maintenance.
Throws Autodesk.Revit.Exceptions.CentralModelException:
The central model is missing.
-or-
An internal error happened on the central model, please contact the server administrator.
Throws Autodesk.Revit.Exceptions.DirectoryNotFoundException:
Thrown when the directory of destination file doesn't exist.
Throws Autodesk.Revit.Exceptions.FileArgumentAlreadyExistsException:
The destination file exists and can't be overwritten.
-or-
destFilePath is pointing to a folder that already exists and cannot be deleted.
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The Revit model specified by sourceModelPath doesn't exist.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The destination file name includes one or more invalid characters.
Throws Autodesk.Revit.Exceptions.RevitServerCommunicationException:
The server-based central model could not be accessed
because of a network communication error.
Throws Autodesk.Revit.Exceptions.RevitServerInternalException:
An internal error happened on the server, please contact the server administrator.
Since:
2012